app/Services/CartService.php

    public static function getItemsInCart($items)
    {
        $products = [];

        foreach ($items as $item) {
            $p = Product::findOrFail($item->product_id);
            $owner = $p->shop->owner->select('name', 'email')->first()->toArray(); //オーナー情報
            $values = array_values($owner); //連想配列の値を取得
            $keys = ['ownerName', 'email'];
            $ownerInfo = array_combine($keys, $values); // オーナー情報のキーを変更

            $product = Product::where('id', $item->product_id)
                ->select('id', 'name', 'price')->get()->toArray(); // 商品情報の配列
            $quantity = Cart::where('product_id', $item->product_id)
                ->select('quantity')->get()->toArray(); // 在庫数の配列
---
select * from `products` where `products`.`id` = 102 limit 1
select `name`, `email` from `owners` where `owners`.`deleted_at` is null limit 1
select `id`, `name`, `price` from `products` where `id` = 102
select `quantity` from `carts` where `product_id` = 102