app/Http/Controllers/User/CartController.php

    public function index()
    {
        $user = User::findOrFail(Auth::id());
---
select * from `users` where `users`.`id` = 1 limit 1

    public function add(Request $request)
    {
        $itemInCart = Cart::where('product_id', $request->product_id)
            ->where('user_id', Auth::id())->first();

        if ($itemInCart) {
            $itemInCart->quantity += $request->quantity;
            $itemInCart->save();
        } else {
            Cart::create([
                'user_id' => Auth::id(),
                'product_id' => $request->product_id,
                'quantity' => $request->quantity
            ]);
---
select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` = 1
select * from `carts` where `product_id` = '193' and `user_id` = 1 limit 1
insert into `carts` (`user_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (1, '193', '1', '2022-09-12 15:00:38', '2022-09-12 15:00:38')

    public function checkout()
    {




        $user = User::findOrFail(Auth::id());
        $products = $user->products;

        $lineItems = [];
        foreach ($products as $product) {
            $quantity = '';
            $quantity = Stock::where('product_id', $product->id)->sum('quantity');
---
select * from `users` where `users`.`id` = 1 limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 102

        }
        // dd($lineItems);
        foreach ($products as $product) {
            Stock::create([
                'product_id' => $product->id,
                'type' => \Constant::PRODUCT_LIST['reduce'],
                'quantity' => $product->pivot->quantity * -1
            ]);
---
insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (102, '2', -1, '2022-09-12 15:28:56', '2022-09-12 15:28:56')

    public function success()
    {
        ////
        $items = Cart::where('user_id', Auth::id())->get();
        $products = CartService::getItemsInCart($items);
        $user = User::findOrFail(Auth::id());

        SendThanksMail::dispatch($products, $user);
        foreach ($products as $product) {
            SendOrderedMail::dispatch($product, $user);
        }
        // dd('ユーザーメール送信テスト');
        ////
        Cart::where('user_id', Auth::id())->delete();
---
select * from `carts` where `user_id` = 1
select * from `users` where `users`.`id` = 1 limit 1
delete from `carts` where `user_id` = 1