app/Http/Controllers/User/ItemController.php

select * from `primary_categories`
---
    public function index(Request $request)
    {
        Mail::to('test@example.com')
        ->send(new TestMail());

        $categories = PrimaryCategory::with('secondary')
        ->get();

select * from `products` where `products`.`id` = '193' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 193
---
    public function show($id)
    {
        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)
        ->sum('quantity');