app/Http/Controllers/Owner/ImageController.php

select * from `images` where `owner_id` = 1 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `images` where `owner_id` = 1
---
    public function index()
    {
        $images = Image::where('owner_id', Auth::id())
            ->orderBy('updated_at', 'desc')
            ->paginate(20);