app/Http/Controllers/Owner/ProductController.php

    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {

            $id = $request->route()->parameter('product');
            if (!is_null($id)) { // null判定
                $productsOwnerId = Product::findOrFail($id)->shop->owner->id;
---
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` = '2' limit 1
select * from `shops` where `shops`.`id` = 1 limit 1

    public function index()
    {
        // $products = Owner::findOrFail(Auth::id())->shop->product;

        $ownerInfo = Owner::with('shop.product.imageFirst')
            ->where('id', Auth::id())->get();
---
select * from `images` where `images`.`id` in (1, 2, 3, 4, 5, 6)
select * from `owners` where `id` = 1 and `owners`.`deleted_at` is null
select * from `products` where `products`.`shop_id` in (1)
select * from `shops` where `shops`.`owner_id` in (1)

    public function edit($id)
    {
        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)
            ->sum('quantity');

        $shops = Shop::where('owner_id', Auth::id())
            ->select('id', 'name')
            ->get();

        $images = Image::where('owner_id', Auth::id())
            ->select('id', 'title', 'filename')
            ->orderBy('updated_at', 'desc')
            ->get();

        $categories = PrimaryCategory::with('secondary')
            ->get();
---
select * from `products` where `products`.`id` = '2' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 2
select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`