app/Http/Controllers/Admin/OwnersController.php

select `id`, `name`, `email`, `created_at` from `owners` where `owners`.`deleted_at` is null limit 3 offset 0
select count(*) as aggregate from `owners` where `owners`.`deleted_at` is null
---
    public function index()
    {
        // $date_now = Carbon::now();
        // $date_parse = Carbon::parse(now());
        // echo $date_now;
        // echo $date_parse;
        // $e_all = Owner::all();
        // $q_get = DB::table('owners')->select('name','created_at')->get();
        // $q_first = DB::table('owners')->select('name')->first();

        // $c_test = collect([
        //     'name' => 'テスト'
        // ]);
        // dd($e_all, $q_get, $q_first, $c_test);
        $owners = Owner::select('id', 'name', 'email', 'created_at')->paginate(3);

select * from `owners` where `owners`.`deleted_at` is not null
---
    public function expiredOwnerIndex()
    {
        $expiredOwners = Owner::onlyTrashed()->get();